In [1]:
!pip install pandas
import psycopg2
from psycopg2.extras import DictCursor
import os
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: pip install --upgrade pip

In [2]:
sql_host = '10.129.0.25'

In [3]:
def get_query(query: int):
    with psycopg2.connect(
        dbname = 'demo',
        user = os.environ['POSTGRESQL_USER'],
        password = os.environ['POSTGRESQL_PASSWORD'],
        host = sql_host
    )as c:
        with c.cursor() as cur:
            cur.execute(query)
            res = cur.fetchall()
            return res

In [9]:
#1.1
query = """
SELECT t.passenger_name, f.departure_airport, f.arrival_airport
FROM tickets t
JOIN ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN flights f ON tf.flight_id = f.flight_id
WHERE t.ticket_no = '0005432312164'
"""
res = get_query(query)
df = pd.DataFrame(res, columns=['passenger_name', 'departure_airport', 'arrival_airport'])
df

      passenger_name departure_airport arrival_airport
0  ALEKSEY GERASIMOV               DME             EGO
1  ALEKSEY GERASIMOV               AAQ             EGO
2  ALEKSEY GERASIMOV               EGO             DME
3  ALEKSEY GERASIMOV               EGO             AAQ

In [5]:
#1.2
query = """
SELECT
    t.passenger_name,
    f.departure_airport,
    f.arrival_airport
FROM
    tickets t,
    ticket_flights tf,
    flights f
WHERE
    t.ticket_no = '0005432312164'
    AND t.ticket_no = tf.ticket_no
    AND tf.flight_id = f.flight_id;
"""
res = get_query(query)
df = pd.DataFrame(res, columns=['passenger_name', 'departure_airport', 'arrival_airport'])
df

      passenger_name departure_airport arrival_airport
0  ALEKSEY GERASIMOV               DME             EGO
1  ALEKSEY GERASIMOV               AAQ             EGO
2  ALEKSEY GERASIMOV               EGO             DME
3  ALEKSEY GERASIMOV               EGO             AAQ

In [6]:
#1.3
query = """
SELECT t.passenger_name, f.departure_airport, f.arrival_airport
FROM tickets t
JOIN ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN flights f ON tf.flight_id = f.flight_id
WHERE t.ticket_no = '0005432312164'
"""
res = get_query(query)
df = pd.DataFrame(res, columns=['passenger_name', 'departure_airport', 'arrival_airport'])
df

      passenger_name departure_airport arrival_airport
0  ALEKSEY GERASIMOV               DME             EGO
1  ALEKSEY GERASIMOV               AAQ             EGO
2  ALEKSEY GERASIMOV               EGO             DME
3  ALEKSEY GERASIMOV               EGO             AAQ

In [7]:
#2
query = """
SELECT f.flight_id, departure.city AS departure_city, arrival.city AS arrival_city
FROM flights f
JOIN ticket_flights tf ON f.flight_id = tf.flight_id
JOIN tickets t ON tf.ticket_no = t.ticket_no
JOIN airports departure ON f.departure_airport = departure.airport_code
JOIN airports arrival ON f.arrival_airport = arrival.airport_code
WHERE t.passenger_name = 'ELLA DMITRIEVA'
"""
res = get_query(query)
df = pd.DataFrame(res, columns=['flight_id', 'departure_city', 'arrival_city'])
df

   flight_id   departure_city       arrival_city
0       8202           Moscow  Yuzhno-Sakhalinsk
1      11445           Moscow    Khanty-Mansiysk
2     142605  Khanty-Mansiysk             Moscow
3      34407           Moscow      Yekaterinburg
4      70804    Yekaterinburg             Moscow
5      74285    Yekaterinburg      Magnetiogorsk
6     193132    Magnetiogorsk      Yekaterinburg

In [8]:
#3
query = """
SELECT *
FROM aircrafts
LIMIT 5
"""
res = get_query(query)
df = pd.DataFrame(res)
df

     0                    1      2
0  773       Boeing 777-300  11100
1  763       Boeing 767-300   7900
2  SU9  Sukhoi Superjet-100   3000
3  320      Airbus A320-200   5700
4  321      Airbus A321-200   5600